# Myisql packages install

pip install mysqlclient
pip install mysql-connector-python
pip install pymysql

In [1]:
import mysql.connector
from mysql.connector import Error
import pandas as pd

In [3]:
def create_server_connection(host_name , user_name , user_password):
    conection = None
    
    try :
        connection = mysql.connector.connect(
        host     =   host_name,
        user     = user_name,
        password = user_password
        )
        print("Mysql Database connection successfully")
        
    except Error as err:
        print(f"Error is '{err}'  ")
        
    return connection

#put our mysql password
pw = "Moawizqazi"

connection = create_server_connection("localhost" , "root" , pw)

Mysql Database connection successfully

In [3]:
#create mysql_python

def create_database(connection , query):
    cursor = connection.cursor()
    try :
        cursor.execute(query)
        print("Database create successfully")
        
    except Error as err:
        print(f"Error : '{err}' ")

create_database_query = "Create database mysql_python"
create_database(connection ,create_database_query)

Error : '1007 (HY000): Can't create database 'mysql_python'; database exists'

In [4]:
#Connect to database
def create_db_connection(host_name , user_name , user_password , db_name):
    connection  = None
    try:
        connection = mysql.connector.connect(
        host     =   host_name,
        user     = user_name,
        password = user_password,
        database = db_name
        )
        print("Mysql Database connection successfully")
        
    except Error as err:
        print(f"Error is '{err}'  ")
        
    return connection

In [5]:
#Execute sql query
def execute_query(connection , query):
    cursor = connection.cursor()
    try :
        cursor.execute(query)
        connection.commit()
        print("Query was successfully")
        
    except Error as err:
        print(f"Error : '{err}' ")

In [9]:
create_order_table = '''
create table orders(
order_id int primary key,
customer_name varchar(30) not null,
product_name varchar(20) not null,
date_ordered date,
quantity int,
unit_price float ,
phone_number varchar(20)

)'''

connection = create_db_connection("localhost" , "root" , pw , 'mysql_python')
execute_query(connection , create_order_table)

Mysql Database connection successfully
Query was successfully

In [11]:
data_orders = '''
insert into orders 
values
(101 , 'Steve'  , ' Laptop'     ,   '2018-06-17'  ,   22  ,   800 ,  25647893 ),
(102 , 'Job'    , ' Trouser'    ,   '2019-05-12'  ,   85  ,   550 ,  58227893 ),
(103 , 'Stacy'  , ' Tv'         ,   '2015-07-13'  ,   88   ,  546 ,  28632544),
(104 , 'Dany'   , ' Mobile'      ,   '2017-06-18'  ,   14  ,  802 ,  14589693 ),
(105 , 'Maria'  , ' Headphones' ,   '2016-02-11'  ,   23  ,   856 ,  22369893 ),
(106 , 'Nancy'  , ' T-Shirts'   ,   '2018-03-10'  ,   55  ,   866 ,  25698741 )
'''
connection = create_db_connection("localhost" , "root" , pw , 'mysql_python')
execute_query(connection , data_orders)

Mysql Database connection successfully
Query was successfully

In [12]:
def read_query(connection, querry):
    cursor = connection.cursor()
    result = None
    
    try:
        cursor.execute(querry)
        result = cursor.fetchall()
        return result
    except Error as err:
        print(f"Error is '{err}'")

In [13]:
#using Select
q1 = '''
select * 
from orders
'''
connection = create_db_connection("localhost" , "root" , pw , 'mysql_python')
results = read_query(connection, q1)

for result in results:
    print(result)

Mysql Database connection successfully
(101, 'Steve', ' Laptop', datetime.date(2018, 6, 17), 22, 800.0, '25647893')
(102, 'Job', ' Trouser', datetime.date(2019, 5, 12), 85, 550.0, '58227893')
(103, 'Stacy', ' Tv', datetime.date(2015, 7, 13), 88, 546.0, '28632544')
(104, 'Dany', ' Mobile', datetime.date(2017, 6, 18), 14, 802.0, '14589693')
(105, 'Maria', ' Headphones', datetime.date(2016, 2, 11), 23, 856.0, '22369893')
(106, 'Nancy', ' T-Shirts', datetime.date(2018, 3, 10), 55, 866.0, '25698741')

In [16]:
q2 = '''
select 
customer_name, phone_number 
from orders
'''
connection = create_db_connection("localhost" , "root" , pw , 'mysql_python')
results = read_query(connection, q2)

for result in results:
    print(result)

Mysql Database connection successfully
('Steve', '25647893')
('Job', '58227893')
('Stacy', '28632544')
('Dany', '14589693')
('Maria', '22369893')
('Nancy', '25698741')

In [17]:
q3 = '''
select 
year(date_ordered) 
from orders
'''
connection = create_db_connection("localhost" , "root" , pw , 'mysql_python')
results = read_query(connection, q3)

for result in results:
    print(result)

Mysql Database connection successfully
(2018,)
(2019,)
(2015,)
(2017,)
(2016,)
(2018,)

In [18]:
q4 = '''
select distinct year(date_ordered)
from orders
'''
connection = create_db_connection("localhost" , "root" , pw , 'mysql_python')
results = read_query(connection, q4)

for result in results:
    print(result)

Mysql Database connection successfully
(2018,)
(2019,)
(2015,)
(2017,)
(2016,)

In [19]:
q5 = '''
select *
from orders
where date_ordered < '2018-12-31'

'''
connection = create_db_connection("localhost" , "root" , pw , 'mysql_python')
results = read_query(connection, q5)

for result in results:
    print(result)

Mysql Database connection successfully
(101, 'Steve', ' Laptop', datetime.date(2018, 6, 17), 22, 800.0, '25647893')
(103, 'Stacy', ' Tv', datetime.date(2015, 7, 13), 88, 546.0, '28632544')
(104, 'Dany', ' Mobile', datetime.date(2017, 6, 18), 14, 802.0, '14589693')
(105, 'Maria', ' Headphones', datetime.date(2016, 2, 11), 23, 856.0, '22369893')
(106, 'Nancy', ' T-Shirts', datetime.date(2018, 3, 10), 55, 866.0, '25698741')

In [20]:
q5 = '''
select *
from orders
where date_ordered > '2018-12-31'

'''
connection = create_db_connection("localhost" , "root" , pw , 'mysql_python')
results = read_query(connection, q5)

for result in results:
    print(result)

Mysql Database connection successfully
(102, 'Job', ' Trouser', datetime.date(2019, 5, 12), 85, 550.0, '58227893')

In [21]:
q6 = '''
select *
from orders
order by unit_price

'''
connection = create_db_connection("localhost" , "root" , pw , 'mysql_python')
results = read_query(connection, q6)

for result in results:
    print(result)

Mysql Database connection successfully
(103, 'Stacy', ' Tv', datetime.date(2015, 7, 13), 88, 546.0, '28632544')
(102, 'Job', ' Trouser', datetime.date(2019, 5, 12), 85, 550.0, '58227893')
(101, 'Steve', ' Laptop', datetime.date(2018, 6, 17), 22, 800.0, '25647893')
(104, 'Dany', ' Mobile', datetime.date(2017, 6, 18), 14, 802.0, '14589693')
(105, 'Maria', ' Headphones', datetime.date(2016, 2, 11), 23, 856.0, '22369893')
(106, 'Nancy', ' T-Shirts', datetime.date(2018, 3, 10), 55, 866.0, '25698741')

In [24]:
from_db = []

for result in results:
    result = list(result)
    from_db.append(result)
columns = ['order_id' ,'customer_name' ,'product_name' ,'date_ordered ','quantity','unit_price'  ,'phone_number']
df = pd.DataFrame(from_db, columns = columns )
display(df)

,order_id,customer_name,product_name,date_ordered,quantity,unit_price,phone_number
0,103,Stacy,Tv,2015-07-13,88,546.0,28632544
1,102,Job,Trouser,2019-05-12,85,550.0,58227893
2,101,Steve,Laptop,2018-06-17,22,800.0,25647893
3,104,Dany,Mobile,2017-06-18,14,802.0,14589693
4,105,Maria,Headphones,2016-02-11,23,856.0,22369893
5,106,Nancy,T-Shirts,2018-03-10,55,866.0,25698741

In [25]:
#update
update = '''
update orders
set unit_price = 455
where order_id = 103
'''
connection = create_db_connection("localhost" , "root" , pw , 'mysql_python')
execute_query(connection , update)

Mysql Database connection successfully
Query was successfully

In [26]:
q7 = '''
select * 
from orders
'''
connection = create_db_connection("localhost" , "root" , pw , 'mysql_python')
results = read_query(connection, q7)

for result in results:
    print(result)

Mysql Database connection successfully
(101, 'Steve', ' Laptop', datetime.date(2018, 6, 17), 22, 800.0, '25647893')
(102, 'Job', ' Trouser', datetime.date(2019, 5, 12), 85, 550.0, '58227893')
(103, 'Stacy', ' Tv', datetime.date(2015, 7, 13), 88, 455.0, '28632544')
(104, 'Dany', ' Mobile', datetime.date(2017, 6, 18), 14, 802.0, '14589693')
(105, 'Maria', ' Headphones', datetime.date(2016, 2, 11), 23, 856.0, '22369893')
(106, 'Nancy', ' T-Shirts', datetime.date(2018, 3, 10), 55, 866.0, '25698741')

In [27]:
#delete
delete = '''
delete  From orders
where order_id =105
'''
connection = create_db_connection("localhost" , "root" , pw , 'mysql_python')
execute_query(connection , delete)

Mysql Database connection successfully
Query was successfully

In [28]:
q8 = '''
select * 
from orders
'''
connection = create_db_connection("localhost" , "root" , pw , 'mysql_python')
results = read_query(connection, q8)

for result in results:
    print(result)

Mysql Database connection successfully
(101, 'Steve', ' Laptop', datetime.date(2018, 6, 17), 22, 800.0, '25647893')
(102, 'Job', ' Trouser', datetime.date(2019, 5, 12), 85, 550.0, '58227893')
(103, 'Stacy', ' Tv', datetime.date(2015, 7, 13), 88, 455.0, '28632544')
(104, 'Dany', ' Mobile', datetime.date(2017, 6, 18), 14, 802.0, '14589693')
(106, 'Nancy', ' T-Shirts', datetime.date(2018, 3, 10), 55, 866.0, '25698741')